Repository: giellalt/corpus-nob
Catalog: prestable/tmx/fkv/ficti/lyrics/ballo_vares_sanga_tekst_norsk.doc.tmx
Source language: nob
Languages: fkv

source: Lang va veien vi vandra
fkv: Kauvoin kuljima kunnes

source: Ut mot fjære og fjord
fkv: näimä pohjaisen maan.

source: Drømman våres va mange
fkv: Toivon tunsima suuren,

source: Da vi reiste mot nord
fkv: siihen luotima ain.

source: Bort fra skogkledde landskap
fkv: Vuonon, fieruan näimä,

source: Til en karrig natur
fkv: luonon jyppyräisen.

source: Sangan som vi har med oss
fkv: Laulut meilä ol' myötä,

source: Fins i moll og i dur
fkv: sävelet syämen.

source: Tonan vi hører
fkv: Sävelten myötä

source: Har følgt oss på veian vi for
fkv: mie juurille palata voin, palata voin.

source: På veian vi for
fkv: Juuret oon vahvat

source: Røttan e lange
fkv: täälä oon nyt.)

source: Men livan vi lever e her
fkv: Tänne pohjaisen maahan

source: Her kor vi bor
fkv: aikaa siiryimä met.

source: Våres håp om ei fremtid
fkv: Täälä rannoila Ruijan

source: Følgte stia og spor
fkv: toivon tunsima met.

source: Og den fremmede jord
fkv: Meän lauluissa kuulet

source: Drøm og virkelighet
fkv: kaiken tapahtunheen.

source: Alt vi trodde og tenkte
fkv: Kaikki unet ja toivheet,

source: Alt vi etterpå vet
fkv: kaikki ajatukset.

source: Våres sanga om livet
fkv: melkhein unheetin sen.

source: Dem som lenge lå gjemt
fkv: Laulun häyvymä laulaa,

source: Ska nu synges og høres
fkv: muistaa sävelen sen.

source: Langs de veian vi fær
fkv: muistaa menneisyyven.

source: Røttan våres e lange
fkv: Vaikka juuret oon vahvat

source: Livan våres e her
fkv: tänne kuuluma met.
